"""Клонирование репозитория для работы"""
# 1. Клонирование репозитория
# git clone https://github.../repository.git

# 2. Создание новой ветки.
# Перед внесением изменений необходимо создать новую ветку.
# Это хорошая практика, чтобы не вносить изменения в основную ветку (main или master)
# cd repository
# git checkout -b my-feature-branch

# 3. Внесение изменений

# 4. git add .
# 5. git commit -m "feat/fix: ..."
# 6. git push origin my-feature-branch

# 7. Ожидание проверки.
# Теперь изменения находятся на рассотрении у других участников проекта.
# Они могут оставлять комментарии, запросить изменения или принять ваш Pull Request.

# 8. Слияние изменений. Если PR принят, его сливают с основной веткой.





