# print('Java')
# print('Ruby')
# print('Scala')
print('Python', end='+')  # print('C++')
# print('GO')
print('C#', end='=')  # print('C')
print('awesome')
# finish


# Материалы Поколения Пайтон: https://disk.yandex.ru/d/phzgG4GoBFfNCg
# # Аргументы - конкретные значения, передаваемые функции при её вызове.

"""Множественное присваивание"""
# Подходит, когда нужно 'обменять' значения переменных
# name1 = 'Gvido'
# name2 = 'Igor'
#
# name1, name2 = name2, name1
#
# print(name1)
# print(name2)

"""Вывести на экран астериски"""
# asterisk_count = [i for i in range(1, 7+1)]
# result = []
#
# for i in asterisk_count:
#     i = i * '*'
#     result.append(i)
#
# print("\n".join(result))